import React from 'react';
import 'bootstrap/dist/css/bootstrap.min.css';
import 'bootstrap/dist/js/bootstrap.bundle.min';

const About = () => {
  return (
    <div className="container py-5">
      <div className="row mt-4">
        <div className="col" style={{ color: 'var(--text-color)', direction: 'rtl', textAlign: 'right' }}>
          <h2 className="mb-4">אודותיי</h2>
          <p>
            שמי מוחמד אגבריה, אדם דינאמי עם רקע חזק בהנדסת תוכנה, ניהול ותחום הכושר. אני בוגר תואר ראשון B.Sc בהנדסת תוכנה ממכללת אורט בראודה, ומשלב את הידע הטכנולוגי שלי עם ניסיון מעשי כמנהל של שלוש תחנות דלק של דור אלון בפרדס חנה, תוך ניהול צוותים של 12–15 עובדים והובלה למצוינות בתוצאות מכירה וניקיון.
          </p>
          <p>
            התחלתי את הדרך שלי כמאמן כושר אישי – תחום שהחדיר בי משמעת, מיקוד ורצון עז לעזור לאחרים להצליח. היום, אני גם מפתח ומעצב אתרים פרילנסר, בונה פתרונות דיגיטליים מודרניים ונקיים, והקמתי את קהילת MElegion לקידום שיתופי פעולה ולחיזוק קהילות טכנולוגיות.
          </p>
          <p>
            הפרויקטים האחרונים שלי משקפים את החזון שלי: פלטפורמת שיווק מבוססת הפניות שמאפשרת לאנשים להרוויח מהבית, ומערכת חכמה לניהול סידור עבודה באמצעות בינה מלאכותית. אני שולט היטב בצד הלקוח והשרת, בעל ניסיון ב־React, Firebase, Express.js וטכנולוגיות נוספות, ותמיד שואף ללמוד ולהשתפר.
          </p>
          <p>
            אני מאמין בעבודה בצוות, בלמידה מתמשכת וביכולת לעשות שינוי אמיתי בעזרת פתרונות טכנולוגיים חכמים, מדויקים ונגישים. בין אם מדובר בפיתוח מערכת, בהובלת צוות או באימון אישי – אני מביא איתי מסירות, יצירתיות ותשוקה להצלחה.
          </p>

          <p className="mt-4">
            ניתן לקרוא עוד באתר האישי שלי:{" "}
            <a href="https://mohameedegbaria.com" target="_blank" rel="noopener noreferrer">
              mohameedegbaria.com
            </a>
          </p>
        </div>
      </div>
    </div>
  );
};

export default About;
